---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures
source: html/ac62db72-a3af-7ef3-b9f4-48a1867a08f1.htm
---
# BuiltInFailures.StructuralCustomConnectionFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.